#region 文件描述
/**************************************************************************
* 创建: Daoting
* 摘要: 
* 日志: 2014-09-24 创建
**************************************************************************/
#endregion

#region 命名空间

#endregion

namespace Dt.App.Workflow
{
    /// <summary>
    /// 同步活动的聚合方式
    /// </summary>
    public enum SyncAtvJoinKind
    {
        /// <summary>
        /// 同步活动前的活动实例必须全部完成，才能激活后续活动
        /// </summary>
        全部任务,

        /// <summary>
        /// 只要同步活动前存在一个已完成的活动实例，就激活后续活动
        /// </summary>
        任一任务,

        /// <summary>
        /// 等待在开始活动到同步活动之间所有已激活的活动完成
        /// </summary>
        即时同步
    }
}
