#region 文件描述
/******************************************************************************
* 创建: Daoting
* 摘要: 
* 日志: 2015-04-07 创建
******************************************************************************/
#endregion

#region 引用命名
#endregion

namespace Dt.Mgr
{
    /// <summary>
    /// 搬运工内置视图名称
    /// </summary>
    public enum LobViews
    {
        主页,
        登录页,
        通讯录,
        文件,
        基础选项,
        菜单管理,
        我的设置,
        参数定义,
        基础权限,
        报表,
        报表设计,
        系统角色,
        用户账号,
        发布,
        发布管理,
        流程设计,
        任务,
    }
}
